Tests/StressTest/UseCaseB.yml
config:
  plugins:
  target: "https://kwqnze338k.us-east-1.awsapprunner.com"
  phases:
   - duration: 200
      arrivalRate: 10
      rampTo: 50
      name: Stress Test

scenarios:
  - name: "Choose one recipe"
    flow:
      - get:
          url: "/recipes"
      - think: 2
      - get:
          url: "/recipes/2"
      - think: 1